"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"%@ (optional)" = "%@ (opțional)";

"(not accepted)" = "(nu este acceptat)";

"Account number" = "Număr cont";

"Address" = "Adresa";

"Address line 1" = "Rândul 1 pentru adresă";

"Address line 2" = "Rândul 2 pentru adresă";

"Area" = "Zonă";

"BLIK code" = "Cod BLIK";

"BSB number" = "Număr BSB";

"Bank account •••• %@" = "Cont bancar •••• %@";

"Billing address is same as shipping" = "Adresa de facturare este la fel cu cea de expediere";

"Cancel" = "Anulare";

"Card brand" = "Marcă card";

"City" = "Oraș";

"Code field" = "Câmp pentru introducerea codului";

"Company" = "Companie";

"Continue" = "Continuare";

"Country" = "Țară";

"Country or region" = "Țară sau regiune";

"County" = "Județ";

"Department" = "Departament";

"District" = "District";

"Do Si" = "Do Si";

"Do you want to close this form?" = "Doriți să închideți acest formular?";

"Done" = "Efectuat";

"Double tap to edit" = "Atingeți de două ori pentru a edita";

"Edit" = "Editare";

"Eircode" = "Eircode";

"Email" = "E-mail";

"Emirate" = "Emirat";

"Error" = "Eroare";

"First" = "Prenume";

"Full name" = "Nume complet";

"Incomplete phone number" = "Număr de telefon incomplet";

"Invalid UPI ID" = "ID UPI nevalid";

"Island" = "Insulă";

"Last" = "Nume de familie";

"Name" = "Nume";

"Name on account" = "Numele contului";

"OK" = "OK";

"Oblast" = "Oblast";

"Other" = "Altele";

"Parish" = "Parohie";

"Phone number" = "Număr de telefon";

"Postal code" = "Cod poștal";

"Prefecture" = "Prefectură";

"Province" = "Provincie";

"Remove" = "Eliminare";

"Remove bank account?" = "Eliminați contul bancar?";

"Remove card" = "Eliminare card";

"Search" = "Căutare";

"Select card brand (optional)" = "Selectare marcă card (opțional)";

"Selection is empty." = "Selecția este goală.";

"Sort code" = "Cod de sortare";

"State" = "Stat";

"Suburb" = "Suburbie";

"Suburb or city" = "Suburbie sau oraș";

"The BSB you entered is incomplete." = "Numărul BSB pe care l-ați introdus nu este complet.";

"The ID number you entered is incomplete." = "Numărul de identificare pe care l-ați introdus nu este complet.";

"The account number you entered is incomplete." = "Numărul de cont pe care l-ați introdus nu este complet.";

"The sort code you entered is invalid." = "Codul de identificare a băncii pe care l-ați introdus nu este valid.";

"Town or city" = "Municipalitate sau oraș";

"UPI ID" = "ID UPI";

"Unable to parse phone number" = "Nu se poate analiza numărul de telefon";

"Use rotor to access links" = "Utilizați rotorul pentru a accesa linkurile";

"Your BLIK code is incomplete." = "Codul dvs. BLIK nu este complet.";

"Your BLIK code is invalid." = "Codul dvs. BLIK nu este valid.";

"Your ZIP code is incomplete." = "Codul dvs. poștal este incomplet.";

"Your ZIP code is invalid." = "Codul dvs. poștal este nevalid.";

"Your email is invalid." = "E-mailul nu este valid.";

"Your payment information will not be saved." = "Informațiile dvs. de plată nu vor fi salvate.";

"Your postal code is incomplete." = "Codul dvs. poștal nu este complet.";

"Your postal code is invalid." = "Codul dvs. poștal nu este valid.";

"ZIP" = "Cod poștal";
